# StairstypeWinderStepFrontMeasurement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeWinderStepFrontMeasurement Property
ParameterTypeId Class See Also
---
"Winder Algorithm": Winder Algorithm
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeWinderStepFrontMeasurement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeWinderStepFrontMeasurement As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeWinderStepFrontMeasurement {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace